app/controllers/tvshows_controller.rb

SELECT "user_shows".* FROM "user_shows"
SELECT "tvshows".* FROM "tvshows"
---
  def index
    @tvshows = Tvshow.all

SELECT  "tvshows".* FROM "tvshows" WHERE "tvshows"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @user = User.find(session[:user_id])
    @tvshow = Tvshow.find(params[:id])

SELECT COUNT(*) FROM "users" INNER JOIN "user_shows" ON "users"."id" = "user_shows"."user_id" WHERE "user_shows"."tvshow_id" = $1  [["tvshow_id", 1]]
UPDATE "tvshows" SET "likes" = $1, "updated_at" = $2 WHERE "tvshows"."id" = $3  [["likes", 2], ["updated_at", "2019-03-08 00:08:02.100177"], ["id", 3]]
INSERT INTO "tvshows" ("name", "tvmaze_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "The Young and the Restless"], ["tvmaze_id", 4344], ["created_at", "2019-03-07 22:55:58.344039"], ["updated_at", "2019-03-07 22:55:58.344039"]]
---
  def create
    if Tvshow.find_by(tvshow_params)
      @tvshow = Tvshow.find_by(tvshow_params)
      @tvshow.update_attribute(:likes, @tvshow.users.count)
    else
      @tvshow = Tvshow.create(tvshow_params)