app/controllers/users_controller.rb

INSERT INTO "users" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "ed4"], ["created_at", "2019-03-07 05:34:18.177115"], ["updated_at", "2019-03-07 05:34:18.177115"]]
SELECT  "users".* FROM "users" WHERE "users"."name" = $1 LIMIT $2  [["name", "tony"], ["LIMIT", 1]]
---
  def create
    byebug
    @user = User.find_or_create_by(name: user_params)